[{"term":"IPv4","definition":"2^32 = 4.294.967.296 = 32 bits"},{"term":"IPv6","definition":"comprimento = 128 bits de comprimento"},{"term":"Tipos IPv6","definition":"UNICAST(identificar unicamente uma interface de rede),     ANYCAST(um indereço IP que designa um grupo de interface), MULTICAST(para identificar um grupo de interfaces)"},{"term":"Exemplo IPv6","definition":"128 bits = 16 bytes = 32 dígitos hexadecimais\nFFDC: 4738:D423:8800:0000:57AB:BC99:3200"},{"term":"Cabeçalho IPv6","definition":"todos os campos do novo cabeçalho possuem tamanho fixo, totalizando 64 bytes, acelera bastante o processamento dos pacotes pelos \nroteadores,  Além disso, ocorreu uma redução dos números de campos \nutilizados"},{"term":"Campo Principai","definition":"FLOW LABEL: (campo \nprincipal) identificar fluxos de pacotes que requerem tratamento especial."},{"term":"Campo Principal","definition":"Hop Limit: semelhante ao TTL do IPv4."},{"term":"ICMPv6","definition":"Essencial e fundamental para IPv6."},{"term":"NDP","definition":"Protocolo responsável por identificar e conhecer características da vizinhança."},{"term":"IPv6 evolução","definition":"O crescimento exponencial da internet e a proliferação de dispositivos conectados trouxeram à tona \num desafio fundamental: a escassez de endereços IP disponíveis no protocolo IPv4."},{"term":"IPv6 objetivo","definition":"escassez de endereços IP disponíveis no protocolo IPv4."},{"term":"Estrutura de indereço IPv6","definition":"são representados em \nnotação hexadecimal e são organizados em grupos de quatro dígitos separados por dois pontos, além disso, o IPv6 introduz endereços \nespeciais, como os endereços loopback (::1) e de link local (fe80::), que têm papéis específicos na comunicação"},{"term":"Benefícios","definition":"segurança, qualidade de serviço e eficiência de roteamento. A \nautoconfiguração de endereços permite que dispositivos conectados obtenham automaticamente \num endereço IPv6 válido sem a necessidade de um servidor DHCP."},{"term":"SLACC","definition":"permite obter IPv6 sem necessidade de DHCP."}]