[{"term":"Padrões Ethernet","definition":"são aquelas que utilizam cabos de par trançado para transmitir dados."},{"term":"Tipos","definition":"existem diversos padrões Ethernet que é importante conhecer, pois eles não se \nlimitam apenas a cabos de par trançado, mas também incluem fibras ópticas e outros meios de \ntransmissão."},{"term":"Princípios fundamentais","definition":"MAC (Controle de Acesso ao Meio), Meio \nFísico (Camada Física) e  LLC (Controle de Link Lógico)."},{"term":"MAC (Controle de Acesso ao Meio)","definition":"tem como função  montar o quadro Ethernet que será enviado pela rede."},{"term":"Meio Físico (Camada Física)","definition":"tem como função Transformar o quadro Ethernet em sinais que possam ser transmitidos pelo meio \nde comunicação."},{"term":"LLC (Controle de Link Lógico)","definition":"tem como função  Identificar o protocolo de nível superior para entregar as informações contidas no \nquadro Ethernet recebido."},{"term":"Endereçamento","definition":"O endereçamento de rede ou simplesmente endereço IP é um número binário (0 e 1) que especifica \nde maneira única um host conectado à uma rede TCP/IP."},{"term":"Conhecimento dos Padrões Ethernet","definition":"existem padrões Ethernet específicos para conexões sem fio, como o Wi-Fi."},{"term":"Seleção e Configuração de Cabos","definition":"Um profissional de redes precisa ser capaz de escolher o tipo certo de cabo com base nos requisitos \nda rede, como distância, largura de banda e ambiente. Eles também devem saber como configurar \ncorretamente os conectores, emendas e terminações dos cabos para garantir uma conexão sólida e \nde alta qualidade."},{"term":"Negociação de Velocidade e Duplex","definition":"Velocidade se refere à taxa de transferência \nde dados entre os dispositivos, enquanto duplex se refere à capacidade de transmitir e receber \ndados simultaneamente."},{"term":"Diagnóstico","definition":"As redes são complexas e propensas a problemas, como falhas de conectividade, latência \nexcessiva, perda de pacotes e muito mais."},{"term":"Solução de problemas","definition":"Pode-se utilizar ferramentas de diagnóstico, como ping, traceroute, analisadores de protocolo e registros de \neventos."},{"term":"Implementação de Redes em Conformidade","definition":"medidas de segurança, como criptografia, autenticação e controle de acesso, para \nproteger os dados e a integridade da rede."},{"term":"Atualização e Migração de Padrões","definition":"migração para redes baseadas em nuvem, a implementação de IPv6 para substituir o \nIPv4 envelhecido e a adoção de protocolos de segurança mais robustos."}]